# Assignment on Model Selection

# 1.Load dataset

In [1]:
import pandas as pd
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import StandardScaler,OneHotEncoder

In [9]:
titanic_df=pd.read_csv(r"C:\Users\Jiss Mathew\Desktop\Python Programming-ICT\Assignment on Model Selection\titanic_dataset .csv")

In [10]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 2.Do all the preprocessing steps

In [11]:
#Handling missing values
#Checking for missing values
missing_values=titanic_df.isnull().sum()
print(missing_values)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
#impute missing values 
imputer=SimpleImputer(strategy='mean')
titanic_df['Age']=imputer.fit_transform(titanic_df[['Age']])

In [18]:
#Encode Categorical values
titanic_df['Sex']=titanic_df['Sex'].map({'females':0,'male':1})

In [31]:
#scale numerical variables
from sklearn.preprocessing import StandardScaler
scale = StandardScaler()
titanic_df[['Age','Fare']]=scale.fit_transform(titanic_df[['Age','Fare']])